/*
  Localizable.strings
  Pods

  Created by mac on 2025/7/5.
  
*/

"watching" = "Following";
"drama_list" = "Dramas";
"recommend" = "Recommend";
"more" = "More";
"all_episodes" = "All %@ episodes";
"episode_no" = "Episode %@";
"watch_full_episode" = "Episodes";
"series_ended" = "Completed";
"series_unfinished" = "Unfinished";
"speed" = "Speed";
"play_speed" = "Speed playback";
"selections" = "Selections";
"close" = "Close";
"expand" = "Expand";
"switched_to_speed" = "Switch to %@ X speed playback";
"free_unlock_by_ad" = "Pay to unlock";
"unlock_after_payment" = "Watch for %@ seconds and pay to unlock";
"support_the_author" = "HD short dramas watch at will";
"accept_the_agreement" = "Recharge representatives accept the \"Recharge Agreement\" and \"Membership Agreement\". Virtual goods purchased cannot be returned or exchanged. Teenagers are advised to recharge with the accompaniment of their parents";
"rules_agreement" = "\"Recharge Agreement\"";
"member_agreement" = "\"Membership Agreement\"";
"alipay_payment" = "Alipay Pay";
"wechat_payment" = "WeChat Pay";
"select_payment_way" = "Please choose a payment method";
"confirm_payment" = "Confirm Payment";
"unlock_congratulations" = "Congratulations \n Get free unlocked episodes";
"unlock_episodes" = "Unlock TV series for free";
"unlock_watching_ads" = "Watch ads and unlock %@ episodes for free";
"unlock_auto_watching_ads" = "Automatically watch ads and unlock %@ episodes for free after 5s";
"watch_now" = "Watch Now";
"follow" = "Follow";
"followed" = "Followed";

"placementId_can_not_nil" = "Advertising space cannot be empty";
"ad_valid" = "The advertisement is invalid, please pull it again";
"watch_ad_unlock" = "Unlock by watching ads";
"ad_unlock_failure" = "Ad unlock failed";
"iap_config_error" = "Abnormal video ad configuration, priority payment, but this video does not support payment";
"iaa_config_error" = "The video ad configuration is abnormal, with priority given to incentivizing ads, but this video does not support incentivizing ads";
"up_contuine_watch" = "Slide up to continue watching";
"unInstall_alipay" = "Alipay client is not detected, please try again after installation";
"unInstall_wechat" = "WeChat client not detected, please install and try again";
"comfin_pay_complete" = "Confirm if payment is complete";
"verifing_pay" = "Payment verification in progress...";
"order_unpay" = "Order unpaid";
"order_payed" = "Order paid";
"order_pay_failure" = "Order payment failed";
"refunded" = "refunded";
"alert_tips"="Warm Reminder";
"alert_confirm_deleted"="Are you sure you want to delete?";
"alert_cancle"="Cancel";
"alert_confirm"="OK";
"play_record_failure"="Playback record reporting failed: %@";
"unit_yuan"="%@";
"watching_ad_to_ulock"="Watch videos to unlock episodes for free";
"continue_watching"="Continue watching";
"quite"="Persist in quitting";
"cancle_collection_title" = "Are you sure you want to cancel favorites?";
"cancle_collection_msg" = "Maybe you won’t be able to find the script after cancellation?";
"cancle_collection_tips" = "Cancel favorites";
"collection_success_tips" = "In My - Viewing history";
"bc_count_nuit_w" = "%@W";
"bc_count_nuit_m" = "%@M";
"unlock_after_watching_ad" = "Try it for %@ seconds and then watch the ad to unlock";

"home" = "Theater";
"recommendForYou" = "Discover";
"myDramas" = "My List";
"profile" = "Me";
"noData" = "No Data";
"refresh" = "Refresh";
"noCollections" = "There are no dramas to watch yet. Go to the homepage to choose a few.";
"toHomePage" = "Go to homepage";
"isClearHistories" = "Are you sure you want to clear your search history?";
"cannotResetWhenClear" = "Search history cannot be restored after it is cleared";
"deletedSuccess" = "Deleted successfully";
"loading" = "Loading...";
"placeholderText" = "Please enter the search keyword";
"searching" = "Search";
"history" = "Search History";
"peopleAreSearching" = "People Are Searching";

"noAnyCollections" = "Go ahead and add it to continue watching the short drama~";
"toDramaList" = "Add to Follow";
"coin_name" = "%@%@";
"myFavorite" = "Collections";
"historyList" = "Histories";
"share" = "Share";
"ad_watch_timer" = "After watching for %@s, Can continue scrolling";
"allow_jump_episode" = "Please play in order and do not skip episodes";
"add_drama_to_my_list" = "It has been added to the follow list. You can view all the shows you are following in [My Show List - Shows I'm Following].";
"screen_record_ban" = "Short drama copyright prohibited recording";
"network_error" = "Network Error";
"try_again" = "Retry";
"please_try_to_renetwork" = "Please check your network connection and try again";

"video_no_auth" = "Unauthorized theater";
"video_no_auth_msg" = "Due to copyright issues, this episode has not been listed on %@";
"pay_to_unlock_episode" = "Pay Now";
"play_finish_to_recommend_other" = "The content has been broadcasted. We recommend the next short play for you";
"my_favorite" = "Follow";
"my_history" = "History";
"watching_drama" = "Watch The Full Drama";
"introduction" = "Introduction";
"totals" = "%@ episodes in total";
"search_no_result" = "No relevant content found";
"to_home" = "Go to the Theater";

"player_episode_no" = "Episode %@";
"all" = "All";
"male" = "Male";
"female" = "Female";
"vip_privilege" = "VIP privilege - watch HD short dramas with freedom";
"ad_free" = "Ad-free throughout the site";
"activate_membership" = "Activate Now";
"renew_membership" = "Renew membership now";
"order" = "Order";
"preference" = "Preference";
"expired" = "%@ expired";
"oeder_no" = "Order number: %@";
"pay_time" = "Payment time: %@";
"expired_time" = "Expiration time: %@";
"copy_order_no" = "Copied order number";
"in_effect" = "In effect";
"out_effect" = "Expired";
"pxpress_your_ideas" = "Express your ideas easily and receive positive feedback that may be adopted";
"play_issue" = "Play issue";
"content_issue" = "Content issue";
"feedback_type" = "Feedback";
"question_type" = "Question";
"selected_the_type_question" = "Please select the question type";
"screenshot" = "Screenshot";
"contact" = "Contact";
"wechat_contact" = "Leave your WeChat or phone number to receive a reply";
"feature_suggestion" = "Suggestion";
"submit_feedback" = "Submit Feedback";
"auto_close" = "Automatically close after %@s";
"thanks_your_feedback" = "Thank you for your feedback! We have received it";
"i_see" = "I see";
"max_select_picture" = "You can only select up to %@ images";
"camera_not_available" = "Camera not available";
"album_not_available" = "Album not available";
"select_all" = "Select All";
"cancle_all" = "Cancel all selections";
"complete" = "Complete";
"all_history" = "All history";
"was_selected" = "%@ selected";
"editting" = "Editing";
"copy_success" = "Copy successful";
"set_nickname" = "Nickname";
"set_avactor" = "Avatar";
"user_policy" = "User Agreement";
"privacy_policy" = "Privacy Policy";
"feedback" = "Feedback";
"setting" = "setting";
"update_successed" = "Update succeeded";
"update_failed" = "Update failed";
"all_order" = "All orders";
"video_preference" = "Preference for watching short dramas";
"saved" = "Saved";
"please_input_nickname" = "Please fill in your nickname";
"upgrade_avactor" = "Upload avatar";
"acactor_from_auble" = "Select from album";
"camera" = "Camera";
"deleted" = "Deleted";
"please_select_follows" = "Please select the drama you want to delete";
"deleted_follows" = "Are you sure you want to delete and cancel the series you're following? ";
"deleted_history" = "Are you sure you want to delete your browsing history? ";
"all_follows" = "All Follows";
"last_episode_no" = "Watch up to episode %@";
"to_watch_video" = "To Follow";
"no_any_content" = "No Content";
"already_set_preference" = "Preferences set";
"cancel_success" = "Cancelled successfully";
